In [2]:
%reload_ext sql
%sql oracle://hr:hr@myoraxe11g:1521/xe

In [18]:
%%sql
CREATE TABLE managers AS
    SELECT employee_id, first_name, job_id, salary, hire_date
    FROM employees
    WHERE 1=2
--create table은 반복시 에러남
--잘 이해는 안되지만, 이렇게 하면 열 제목만 생성됨, 데이터는 따라오지 않음(where절 없애면 따라옴)
--데이터 형태는 그대로 남아있지 않을까

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM managers

In [24]:
%%sql
INSERT INTO managers 
    (employee_id, first_name, job_id, salary, hire_date)
    SELECT employee_id, first_name, job_id, salary, hire_date
    FROM employees
    WHERE job_id LIKE '%MAN'

 * oracle://hr:***@myoraxe11g:1521/xe
12 rows affected.

[]

In [26]:
%%sql
commit
--데이터베이스에 영구적으로 반영

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [27]:
%%sql
UPDATE managers
SET salary = 20000
WHERE employee_id = 107
--where 조건 안붙이면 모두 적용되니 조심

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM managers

In [30]:
%%sql 
CREATE TABLE emps AS SELECT * FROM employees
--전부 데이터가 복사됨

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [ ]:
%%sql
DESC emps
--이거 주피터에서 안됨

In [32]:
%%sql
UPDATE emps
SET(job_id, salary, manager_id) = 
    (SELECT job_id, salary, manager_id 
    FROM emps
    WHERE employee_id = 108)
WHERE employee_id = 109
--109번 직원에 108번 직원 데이터를 갖다붙임

 * oracle://hr:***@myoraxe11g:1521/xe
1 rows affected.

[]

In [33]:
%%sql
DELETE FROM emps
WHERE employee_id = 104

 * oracle://hr:***@myoraxe11g:1521/xe
1 rows affected.

[]

In [34]:
%%sql
SELECT * FROM emps WHERE manager_id = 103

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', datetime.datetime(2005, 6, 25, 0, 0), 'IT_PROG', Decimal('4800'), None, 103, 60),
 (106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', datetime.datetime(2006, 2, 5, 0, 0), 'IT_PROG', Decimal('4800'), None, 103, 60),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.datetime(2007, 2, 7, 0, 0), 'IT_PROG', Decimal('4200'), None, 103, 60)]

In [36]:
%%sql
CREATE TABLE emp AS
    SELECT employee_id AS empno, first_name AS ename,
        salary AS sal, department_id AS deptno
    FROM employees

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [37]:
%%sql
SELECT empno, ename, sal, deptno FROM emp WHERE deptno = 30

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(114, 'Den', Decimal('11000'), 30),
 (115, 'Alexander', Decimal('3100'), 30),
 (116, 'Shelli', Decimal('2900'), 30),
 (117, 'Sigal', Decimal('2800'), 30),
 (118, 'Guy', Decimal('2600'), 30),
 (119, 'Karen', Decimal('2500'), 30)]

In [73]:
%%sql
UPDATE emp SET sal = sal + 500
WHERE empno = 115
--여러사람이 함께 접근하면 락이 걸린다는데 아직까지 완전히 이해가 되지 않음ㅜㅜ

 * oracle://hr:***@myoraxe11g:1521/xe
1 rows affected.

[]

In [74]:
%%sql
SELECT empno, ename, sal, deptno 
FROM emp 
WHERE deptno = 30

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(114, 'Den', Decimal('11000'), 30),
 (115, 'Alexander', Decimal('5100'), 30),
 (116, 'Shelli', Decimal('2900'), 30),
 (117, 'Sigal', Decimal('2800'), 30),
 (118, 'Guy', Decimal('2600'), 30),
 (119, 'Karen', Decimal('2500'), 30)]

In [47]:
%%sql
CREATE TABLE dept (
    deptno NUMBER(2),
    dname VARCHAR2(14),
    loc VARCHAR2(13) )
--이전 Create Table은 다른 데이터에서 테이블을 가져오는 것이지만, 이건 새로생성하는 것
--dept는 테이블 이름
--콤마조심

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [75]:
%%sql
commit

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [76]:
%%sql
rollback

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [81]:
%%sql
CREATE TABLE emp_dept50 
AS SELECT employee_id, first_name, salary, job_id
FROM employees
WHERE department_id = 50

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

### ALTER TABLE

In [82]:
%%sql 
ALTER TABLE emp_dept50
ADD (job VARCHAR2(10))

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [83]:
%%sql
ALTER TABLE emp_dept50
RENAME COLUMN job TO job_id2
--Column 열이름 변경

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [84]:
%%sql
ALTER TABLE emp_dept50
MODIFY(first_name VARCHAR(30))
--데이터의 크기를 조정

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [85]:
%%sql
SELECT *
FROM emp_dept50

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(120, 'Matthew', Decimal('8000'), 'ST_MAN', None),
 (121, 'Adam', Decimal('8200'), 'ST_MAN', None),
 (122, 'Payam', Decimal('7900'), 'ST_MAN', None),
 (123, 'Shanta', Decimal('6500'), 'ST_MAN', None),
 (124, 'Kevin', Decimal('5800'), 'ST_MAN', None),
 (125, 'Julia', Decimal('3200'), 'ST_CLERK', None),
 (126, 'Irene', Decimal('2700'), 'ST_CLERK', None),
 (127, 'James', Decimal('2400'), 'ST_CLERK', None),
 (128, 'Steven', Decimal('2200'), 'ST_CLERK', None),
 (129, 'Laura', Decimal('3300'), 'ST_CLERK', None),
 (130, 'Mozhe', Decimal('2800'), 'ST_CLERK', None),
 (131, 'James', Decimal('2500'), 'ST_CLERK', None),
 (132, 'TJ', Decimal('2100'), 'ST_CLERK', None),
 (133, 'Jason', Decimal('3300'), 'ST_CLERK', None),
 (134, 'Michael', Decimal('2900'), 'ST_CLERK', None),
 (135, 'Ki', Decimal('2400'), 'ST_CLERK', None),
 (136, 'Hazel', Decimal('2200'), 'ST_CLERK', None),
 (137, 'Renske', Decimal('3600'), 'ST_CLERK', None),
 (138, 'Stephen', Decimal('3200'), 'ST_CLERK', None),
 (139, 'John', Decimal('2700'), 'ST_CLERK', None),
 (140, 'Joshua', Decimal('2500'), 'ST_CLERK', None),
 (141, 'Trenna', Decimal('3500'), 'ST_CLERK', None),
 (142, 'Curtis', Decimal('3100'), 'ST_CLERK', None),
 (143, 'Randall', Decimal('2600'), 'ST_CLERK', None),
 (144, 'Peter', Decimal('2500'), 'ST_CLERK', None),
 (180, 'Winston', Decimal('3200'), 'SH_CLERK', None),
 (181, 'Jean', Decimal('3100'), 'SH_CLERK', None),
 (182, 'Martha', Decimal('2500'), 'SH_CLERK', None),
 (183, 'Girard', Decimal('2800'), 'SH_CLERK', None),
 (184, 'Nandita', Decimal('4200'), 'SH_CLERK', None),
 (185, 'Alexis', Decimal('4100'), 'SH_CLERK', None),
 (186, 'Julia', Decimal('3400'), 'SH_CLERK', None),
 (187, 'Anthony', Decimal('3000'), 'SH_CLERK', None),
 (188, 'Kelly', Decimal('3800'), 'SH_CLERK', None),
 (189, 'Jennifer', Decimal('3600'), 'SH_CLERK', None),
 (190, 'Timothy', Decimal('2900'), 'SH_CLERK', None),
 (191, 'Randall', Decimal('2500'), 'SH_CLERK', None),
 (192, 'Sarah', Decimal('4000'), 'SH_CLERK', None),
 (193, 'Britney', Decimal('3900'), 'SH_CLERK', None),
 (194, 'Samuel', Decimal('3200'), 'SH_CLERK', None),
 (195, 'Vance', Decimal('2800'), 'SH_CLERK', None),
 (196, 'Alana', Decimal('3100'), 'SH_CLERK', None),
 (197, 'Kevin', Decimal('3000'), 'SH_CLERK', None),
 (198, 'Donald', Decimal('2600'), 'SH_CLERK', None),
 (199, 'Douglas', Decimal('2600'), 'SH_CLERK', None)]

### DROP, TRUNCATE

In [60]:
%%sql 
DROP TABLE emp_dept50
--테이블 완전히 날려버리기 (테이블 구조도 날라가서 찾을시 에러뜸)
--롤백 불가

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [62]:
%%sql
TRUNCATE TABLE emps
--모든 행을 삭제(테이블 구조는 남아있음, 열이름이 남아있음)
--사용된 기억공간을 해제(저장공간 해제)
--삭제한 행을 롤백할 수 없음
--대안으로 delete 문장을 사용(이건 저장공간을 해제할 수는 없음, 롤백이 가능)

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM emp_dept50

In [87]:
%%sql
DROP TABLE emp_dept50
--다시 조회시 에러뜸

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [88]:
%%sql
TRUNCATE TABLE emps

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [91]:
%%sql
CREATE TABLE emp4(
        empno NUMBER(4) CONSTRAINT emp4_empno_pk PRIMARY KEY,
        ename VARCHAR2(10) NOT NULL,
        sal NUMBER(7,2) CONSTRAINT emp4_sal_ck CHECK(sal <= 10000),
        deptno NUMBER(2) CONSTRAINT emp4_deptno_dpet_deptid_fk
                            REFERENCES departments(department_id)
        )

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

### VIEW

In [ ]:
%%sql
CREATE VIEW emp_view_dept60
AS SELECT employee_id, first_name, last_name, job_id, salary
    FROM employees
    WHERE department_id = 60
--뷰는 쿼리의 결과를 가상의 테이블로 만드는 것

In [102]:
%%sql 
SELECT *
FROM emp_view_dept60

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(103, 'Alexander', 'Hunold', 'IT_PROG', Decimal('9000')),
 (104, 'Bruce', 'Ernst', 'IT_PROG', Decimal('6000')),
 (105, 'David', 'Austin', 'IT_PROG', Decimal('4800')),
 (106, 'Valli', 'Pataballa', 'IT_PROG', Decimal('4800')),
 (107, 'Diana', 'Lorentz', 'IT_PROG', Decimal('4200'))]

In [ ]:
%%sql 
CREATE VIEW emp_view
AS SELECT e.employee_id AS id,
    e.first_name AS name,
    d.department_name AS department,
    j.job_title AS job
FROM employees e
JOIN departments d ON e.department_id = d.department_id
JOIN jobs j ON e.job_id = j.job_id
--한번 생성시 에러

### 시퀀스

In [108]:
%%sql
CREATE SEQUENCE depts_seq
INCREMENT BY 1
START WITH 91
MAXVALUE 100
NOCYCLE
NOCACHE

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[]

In [111]:
%%sql
SELECT DEPTS_SEQ.nextval FROM dual

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(92,)]

In [110]:
%%sql
SELECT *
FROM depts_seq

 * oracle://hr:***@myoraxe11g:1521/xe

DatabaseError: (cx_Oracle.DatabaseError) ORA-02201: sequence not allowed here
[SQL: SELECT * FROM depts_seq]
(Background on this error at: http://sqlalche.me/e/4xp6)

In [ ]:
CREATE INDEX emp4